{
  "nodes": [
    {
      "op": "null", 
      "name": "input.1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p0", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p2", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p3", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_nn_bias_add_multiply_add_1", 
      "attrs": {
        "func_name": "fused_nn_conv2d_nn_bias_add_multiply_add_1", 
        "flatten_data": "0", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          0, 
          0, 
          0
        ], 
        [
          1, 
          0, 
          0
        ], 
        [
          2, 
          0, 
          0
        ], 
        [
          3, 
          0, 
          0
        ], 
        [
          4, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p4", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p5", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p6", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p7", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_nn_bias_add_multiply_add_nn_relu", 
      "attrs": {
        "func_name": "fused_nn_conv2d_nn_bias_add_multiply_add_nn_relu", 
        "flatten_data": "0", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          5, 
          0, 
          0
        ], 
        [
          6, 
          0, 
          0
        ], 
        [
          7, 
          0, 
          0
        ], 
        [
          8, 
          0, 
          0
        ], 
        [
          9, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p8", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p9", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p10", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p11", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_nn_bias_add_multiply_add_add_nn_relu", 
      "attrs": {
        "func_name": "fused_nn_conv2d_nn_bias_add_multiply_add_add_nn_relu", 
        "flatten_data": "0", 
        "num_inputs": "6", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          10, 
          0, 
          0
        ], 
        [
          11, 
          0, 
          0
        ], 
        [
          12, 
          0, 
          0
        ], 
        [
          13, 
          0, 
          0
        ], 
        [
          14, 
          0, 
          0
        ], 
        [
          5, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p12", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p13", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p14", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p15", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_nn_bias_add_multiply_add_nn_relu1", 
      "attrs": {
        "func_name": "fused_nn_conv2d_nn_bias_add_multiply_add_nn_relu", 
        "flatten_data": "0", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          15, 
          0, 
          0
        ], 
        [
          16, 
          0, 
          0
        ], 
        [
          17, 
          0, 
          0
        ], 
        [
          18, 
          0, 
          0
        ], 
        [
          19, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p16", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p17", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p18", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p19", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_nn_bias_add_multiply_add_add_nn_relu1", 
      "attrs": {
        "func_name": "fused_nn_conv2d_nn_bias_add_multiply_add_add_nn_relu", 
        "flatten_data": "0", 
        "num_inputs": "6", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          20, 
          0, 
          0
        ], 
        [
          21, 
          0, 
          0
        ], 
        [
          22, 
          0, 
          0
        ], 
        [
          23, 
          0, 
          0
        ], 
        [
          24, 
          0, 
          0
        ], 
        [
          15, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p20", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p21", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p22", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p23", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_nn_bias_add_multiply_add_nn_relu2", 
      "attrs": {
        "func_name": "fused_nn_conv2d_nn_bias_add_multiply_add_nn_relu", 
        "flatten_data": "0", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          25, 
          0, 
          0
        ], 
        [
          26, 
          0, 
          0
        ], 
        [
          27, 
          0, 
          0
        ], 
        [
          28, 
          0, 
          0
        ], 
        [
          29, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p24", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p25", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p26", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p27", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_nn_bias_add_multiply_add_add_nn_relu2", 
      "attrs": {
        "func_name": "fused_nn_conv2d_nn_bias_add_multiply_add_add_nn_relu", 
        "flatten_data": "0", 
        "num_inputs": "6", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          30, 
          0, 
          0
        ], 
        [
          31, 
          0, 
          0
        ], 
        [
          32, 
          0, 
          0
        ], 
        [
          33, 
          0, 
          0
        ], 
        [
          34, 
          0, 
          0
        ], 
        [
          25, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p28", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p29", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p30", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p31", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_nn_bias_add_multiply_add", 
      "attrs": {
        "func_name": "fused_nn_conv2d_nn_bias_add_multiply_add", 
        "flatten_data": "0", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          35, 
          0, 
          0
        ], 
        [
          36, 
          0, 
          0
        ], 
        [
          37, 
          0, 
          0
        ], 
        [
          38, 
          0, 
          0
        ], 
        [
          39, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_reshape_nn_batch_flatten_multiply", 
      "attrs": {
        "func_name": "fused_reshape_nn_batch_flatten_multiply", 
        "flatten_data": "0", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          40, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p32", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p33", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_dense_nn_bias_add", 
      "attrs": {
        "func_name": "fused_nn_dense_nn_bias_add", 
        "flatten_data": "0", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          41, 
          0, 
          0
        ], 
        [
          42, 
          0, 
          0
        ], 
        [
          43, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_softmax", 
      "attrs": {
        "func_name": "fused_nn_softmax", 
        "flatten_data": "0", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          44, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p34", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p35", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p36", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p37", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_nn_bias_add_multiply_add_2", 
      "attrs": {
        "func_name": "fused_nn_conv2d_nn_bias_add_multiply_add_2", 
        "flatten_data": "0", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          35, 
          0, 
          0
        ], 
        [
          46, 
          0, 
          0
        ], 
        [
          47, 
          0, 
          0
        ], 
        [
          48, 
          0, 
          0
        ], 
        [
          49, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_reshape_nn_batch_flatten_multiply_1", 
      "attrs": {
        "func_name": "fused_reshape_nn_batch_flatten_multiply_1", 
        "flatten_data": "0", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          50, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p38", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p39", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_dense_nn_bias_add_nn_relu", 
      "attrs": {
        "func_name": "fused_nn_dense_nn_bias_add_nn_relu", 
        "flatten_data": "0", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          51, 
          0, 
          0
        ], 
        [
          52, 
          0, 
          0
        ], 
        [
          53, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_batch_flatten_multiply", 
      "attrs": {
        "func_name": "fused_nn_batch_flatten_multiply", 
        "flatten_data": "0", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          54, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p40", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p41", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_dense_nn_bias_add_tanh", 
      "attrs": {
        "func_name": "fused_nn_dense_nn_bias_add_tanh", 
        "flatten_data": "0", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [
          55, 
          0, 
          0
        ], 
        [
          56, 
          0, 
          0
        ], 
        [
          57, 
          0, 
          0
        ]
      ]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    3, 
    4, 
    6, 
    7, 
    8, 
    9, 
    11, 
    12, 
    13, 
    14, 
    16, 
    17, 
    18, 
    19, 
    21, 
    22, 
    23, 
    24, 
    26, 
    27, 
    28, 
    29, 
    31, 
    32, 
    33, 
    34, 
    36, 
    37, 
    38, 
    39, 
    42, 
    43, 
    46, 
    47, 
    48, 
    49, 
    52, 
    53, 
    56, 
    57
  ], 
  "heads": [
    [
      45, 
      0, 
      0
    ], 
    [
      58, 
      0, 
      0
    ]
  ], 
  "attrs": {
    "storage_id": [
      "list_int", 
      [
        0, 
        1, 
        2, 
        3, 
        4, 
        5, 
        6, 
        7, 
        8, 
        9, 
        10, 
        11, 
        12, 
        13, 
        14, 
        15, 
        16, 
        17, 
        18, 
        19, 
        10, 
        20, 
        21, 
        22, 
        23, 
        5, 
        24, 
        25, 
        26, 
        27, 
        10, 
        28, 
        29, 
        30, 
        31, 
        15, 
        32, 
        33, 
        34, 
        35, 
        10, 
        5, 
        36, 
        37, 
        38, 
        39, 
        40, 
        41, 
        42, 
        43, 
        38, 
        44, 
        45, 
        46, 
        38, 
        44, 
        47, 
        48, 
        49
      ]
    ], 
    "shape": [
      "list_shape", 
      [
        [1, 2, 15, 15], 
        [32, 2, 3, 3], 
        [32], 
        [32, 1, 1], 
        [32, 1, 1], 
        [1, 32, 15, 15], 
        [32, 32, 3, 3], 
        [32], 
        [32, 1, 1], 
        [32, 1, 1], 
        [1, 32, 15, 15], 
        [32, 32, 3, 3], 
        [32], 
        [32, 1, 1], 
        [32, 1, 1], 
        [1, 32, 15, 15], 
        [32, 32, 3, 3], 
        [32], 
        [32, 1, 1], 
        [32, 1, 1], 
        [1, 32, 15, 15], 
        [32, 32, 3, 3], 
        [32], 
        [32, 1, 1], 
        [32, 1, 1], 
        [1, 32, 15, 15], 
        [32, 32, 3, 3], 
        [32], 
        [32, 1, 1], 
        [32, 1, 1], 
        [1, 32, 15, 15], 
        [32, 32, 3, 3], 
        [32], 
        [32, 1, 1], 
        [32, 1, 1], 
        [1, 32, 15, 15], 
        [2, 32, 1, 1], 
        [2], 
        [2, 1, 1], 
        [2, 1, 1], 
        [1, 2, 15, 15], 
        [1, 450], 
        [225, 450], 
        [225], 
        [1, 225], 
        [1, 225], 
        [1, 32, 1, 1], 
        [1], 
        [1, 1, 1], 
        [1, 1, 1], 
        [1, 1, 15, 15], 
        [1, 225], 
        [128, 225], 
        [128], 
        [1, 128], 
        [1, 128], 
        [1, 128], 
        [1], 
        [1, 1]
      ]
    ], 
    "dltype": [
      "list_str", 
      [
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32"
      ]
    ]
  }, 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59
  ]
}